20220427215330-github_actions.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-03-12 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>GitHub Actions</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel="preconnect" href="https://fonts.googleapis.com"><link rel="preconnect" href="https://fonts.gstatic.com" crossorigin><link href="https://fonts.googleapis.com/css2?family=Ultra&display=swap" rel="stylesheet"><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">GitHub Actions</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0a49f4a">概要</a></li>
<li><a href="#org848f5f4">Memo</a>
<ul>
<li><a href="#orge816ef5">差分をチェックする</a></li>
<li><a href="#org04fc163">jobを共通化する</a></li>
<li><a href="#orgb001a7d">キャッシュ破棄ポリシーの落とし穴</a></li>
<li><a href="#org58c029a">cacheスコープ</a></li>
<li><a href="#org6e0062b">reuseable actionにおけるsecretsの扱い方</a></li>
<li><a href="#org3f95345">Stale Bot</a></li>
<li><a href="#orgef02b29">PRの編集ファイルによって自動でラベルをつける</a></li>
<li><a href="#org23b439c">GitHub Actionsのトリガー</a></li>
</ul>
</li>
<li><a href="#org4419fe0">Tasks</a>
<ul>
<li><a href="#org7ad72f1">実行時間の統計を取りたい</a></li>
<li><a href="#org84bbb2c"><span class="done DONE">DONE</span> GitHub Actions向け自作アクションの作り方｜Tably｜note</a></li>
</ul>
</li>
<li><a href="#org10e4816">Reference</a>
<ul>
<li><a href="#orga9406ca">release-drafter/release-drafter: Drafts your next release notes as pull requests are merged into master.</a></li>
<li><a href="#org40bf869">GitHub Actions - 再利用可能ワークフローを使う | 豆蔵デベロッパーサイト</a></li>
<li><a href="#orgd232186">continuous integration - Secret interpolation is giving syntax error in caller workflow when calling a resusable workflow in GitHub Action - Stack Overflow</a></li>
<li><a href="#org9109796">GitHub ActionsにおけるStep/Job/Workflow設計論</a></li>
<li><a href="#org439b3ae">Composite Action Template を作りました GitHub Actions</a></li>
</ul>
</li>
<li><a href="#orga5617fb">Archives</a></li>
</ul>
</div>
</div>
<div id="outline-container-org0a49f4a" class="outline-2">
<h2 id="org0a49f4a"><a href="#org0a49f4a">概要</a></h2>
<div class="outline-text-2" id="text-org0a49f4a">
<p>
GitHub Actionsは<a href="20210926103926-github.html#ID-6b889822-21f1-4a3e-9755-e3ca52fa0bc4">GitHub</a>が提供する<a href="20220212141124-ci.html#ID-eaf6ed04-7927-4a16-ba94-fbb9f6e76166">CI</a>/<a href="20220212141243-cd.html#ID-2c4cb3a7-7a8a-4a3b-88c2-2c5e69515764">CD</a>環境。
コードやプロジェクトに対するタスクを実行できる。
</p>
</div>
</div>
<div id="outline-container-org848f5f4" class="outline-2">
<h2 id="org848f5f4"><a href="#org848f5f4">Memo</a></h2>
<div class="outline-text-2" id="text-org848f5f4">
</div>
<div id="outline-container-orge816ef5" class="outline-3">
<h3 id="orge816ef5"><a href="#orge816ef5">差分をチェックする</a></h3>
<div class="outline-text-3" id="text-orge816ef5">
</div>
</div>
<div id="outline-container-org04fc163" class="outline-3">
<h3 id="org04fc163"><a href="#org04fc163">jobを共通化する</a></h3>
<div class="outline-text-3" id="text-org04fc163">
<p>
job間での共通部分はまとめて書くことですっきり書け、ジョブの高速化もできる。
</p>

<ul class="org-ul">
<li>キャッシュ</li>
<li>言語環境</li>
</ul>

<p>
はどのタスクでも使うので、共通化できる。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>例。setup-&gt;(build, test)とジョブが実行される</label><pre class="src src-yaml">name: Check

on:
  push:

jobs:
  # 共通処理で言語環境とキャッシュの用意をやる
  setup:
    runs-on: ubuntu-latest
    steps:
      - name: set up
        uses: actions/setup-go@v2
        with:
          go-version: ^1.19
      - name: check out
        uses: actions/checkout@v3
      - name: Cache
        uses: actions/cache@main
        with:
          path: ~/go/pkg/mod
          key: ${{ runner.os }}-go-${{ hashFiles('**/go.sum') }}
          restore-keys: |
            ${{ runner.os }}-go-
  build:
    needs: setup # 依存関係
    runs-on: ubuntu-latest
    steps:
      - uses: actions/checkout@v3
      - name: build
        run: go build .
  test:
    needs: setup # 依存関係
    runs-on: ubuntu-latest
    steps:
      - uses: actions/checkout@v3
      - name: test
        run: go test . -v
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb001a7d" class="outline-3">
<h3 id="orgb001a7d"><a href="#orgb001a7d">キャッシュ破棄ポリシーの落とし穴</a></h3>
<div class="outline-text-3" id="text-orgb001a7d">
<p>
毎回ビルドキャッシュ保存をしてるのに、あまりキャッシュヒットせず、毎回最初からになる現象に悩まされていた。デフォルトブランチでもマージするたびに行っていたので、キャッシュのブランチスコープの問題ではないように見えた。
</p>

<p>
問題の原因は、キャッシュ破棄ポリシーだった。1週間という期間と、リポジトリ合計で10GBという制限がある。
</p>

<blockquote>
<p>
利用制限と退去のポリシー
GitHubは、7日間以上アクセスされていないキャッシュエントリを削除します。 There is no limit on the number of caches you can store, but the total size of all caches in a repository is limited to 10 GB.
この制限を超えた場合、GitHubは新しいキャッシュを保存しますが、合計サイズがリポジトリの制限以下になるまでキャッシュを退去させはじめます。
</p>
</blockquote>

<p>
キャッシュサイズは2GBあったため、5回分しか保持されない計算。その回数のうちで、デフォルトブランチ以外のビルドでキャッシュが追い出されていくため、デフォルトブランチでのキャッシュがない状態になる。そのため、キャッシュヒットしない状態になる。妥協点はデフォルトブランチでのみキャッシュ保存し、別のブランチでは読み込みだけにすることだが、cacheアクションには保存だけするオプションがない。
</p>

<ul class="org-ul">
<li><a href="https://github.com/actions/cache/pull/489">https://github.com/actions/cache/pull/489</a></li>
</ul>
</div>
</div>

<div id="outline-container-org58c029a" class="outline-3">
<h3 id="org58c029a"><a href="#org58c029a">cacheスコープ</a></h3>
<div class="outline-text-3" id="text-org58c029a">
<ul class="org-ul">
<li><a href="https://zenn.dev/mallowlabs/articles/github-actions-cache-scope#actions%2Fcache-%E3%81%AE%E3%82%B9%E3%82%B3%E3%83%BC%E3%83%97">GitHub Actions の cache アクションでキャッシュヒットしない時はスコープを確認してみる</a></li>
<li><a href="https://docs.github.com/en/actions/using-workflows/caching-dependencies-to-speed-up-workflows#restrictions-for-accessing-a-cache">Caching dependencies to speed up workflows - GitHub Docs</a></li>
</ul>

<p>
pushトリガーのジョブで、こんな感じにキャッシュを使っているとする。
</p>
<div class="org-src-container">
<pre class="src src-yaml">- name: Cache Docker layers
  uses: actions/cache@v3
  with:
    path: /tmp/.buildx-cache
    key: ${{ runner.os }}-buildx-${{ github.sha }}
    restore-keys: |
      ${{ runner.os }}-buildx-
</pre>
</div>

<p>
restore-keysはキャッシュ検索に使うkey。メインのkeyはgithub.shaによってすべてのコミットで別々にキャッシュ保存するので、完全一致でキャッシュ取得できることはない。ので、restore-keyが必要。キーが部分一致するので、後続のコミットで利用できる。
</p>

<p>
が、これだけではブランチが変わったとき、ブランチの最初ではキャッシュが利用されない。これがスコープ。スコープの探索は 同じブランチ → ベースブランチ → デフォルトブランチ のみで行われるので、ブランチの最初ではヒットしないということ。これを防ぐために、デフォルトブランチで定期的にpush保存を必要がある。
</p>

<blockquote>
<p>
キャッシュキーのマッチング
cache アクションは最初に、ワークフロー実行を含むブランチで key および restore-keys のキャッシュヒットを検索します。 現在のブランチにヒットがない場合、cache アクションは、親ブランチと上流のブランチで key および restore-keys を検索します。
restore-keys allows you to specify a list of alternate restore keys to use when there is a cache miss on key. 特定の度合いが強いものから弱いものへ並べて複数のリストアキーを作成できます。 The cache action searches the restore-keys in sequential order. キーが直接マッチしなかった場合、アクションはリストアキーでプレフィックスされたキーを検索します。 リストアキーに対して複数の部分一致があった場合、アクションは最も最近に作成されたキャッシュを返します。
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org6e0062b" class="outline-3">
<h3 id="org6e0062b"><a href="#org6e0062b">reuseable actionにおけるsecretsの扱い方</a></h3>
<div class="outline-text-3" id="text-org6e0062b">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>caller</label><pre class="src src-yaml">jobs:
  called:
    uses: user/repo/.github/workflows/called.yml@main
    with:
      text: ${{ github.event.inputs.text }}
      secrets: # ←←←
      DUMMY: ${{ secrets.DUMMY }} # ←←← caller側ではとくになにもせずともsecretsが使える
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>called</label><pre class="src src-yaml">on:
  workflow_call:
    inputs:
      text:
        type: string
        required: true
    secrets: # ←←←
      DUMMY: # ←←←called側ではここで定義されていて、かつ呼び出し側のsecretsで定義されてないとsecretsは参照不可
        required: true

jobs:
  called:
    runs-on: ubuntu-latest
    steps:
      - name: output secret
        run: |
          echo ${{ secrets.DUMMY }}
</pre>
</div>
</div>
</div>
<div id="outline-container-org3f95345" class="outline-3">
<h3 id="org3f95345"><a href="#org3f95345">Stale Bot</a></h3>
<div class="outline-text-3" id="text-org3f95345">
<p>
動きがないIssueやPRを自動的にマークしたりcloseするGitHub bot。
<a href="https://github.com/probot/stale">probot/stale: A GitHub App built with Probot that closes abandoned Issues and Pull Requests after a period of inactivity.</a>
</p>

<p>
設定の例(rubocop)。
<a href="https://github.com/rubocop/rubocop/blob/master/.github/stale.yml">https://github.com/rubocop/rubocop/blob/master/.github/stale.yml</a>
</p>
</div>
</div>
<div id="outline-container-orgef02b29" class="outline-3">
<h3 id="orgef02b29"><a href="#orgef02b29">PRの編集ファイルによって自動でラベルをつける</a></h3>
<div class="outline-text-3" id="text-orgef02b29">
<p>
面倒なラベル付けを自動化する。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 4: </span>actions <a href="https://github.com/upptime/uptime-monitor/blob/master/.github/workflows/labeler.yml">https://github.com/upptime/uptime-monitor/blob/master/.github/workflows/labeler.yml</a></label><pre class="src src-yaml">name: Pull Request Labeler
on:
  - pull_request
  - pull_request_review
jobs:
  triage:
    runs-on: ubuntu-latest
    steps:
      - name: Label all PRs
        uses: actions/labeler@master
        with:
          repo-token: "${{ secrets.GH_PAT }}"
      - name: Label approved PRs
        uses: koj-co/label-approved-action@master
        with:
          labels: "merge"
        env:
          GITHUB_TOKEN: "${{ secrets.GH_PAT }}"
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 5: </span>labels.yml <a href="https://github.com/upptime/uptime-monitor/blob/master/.github/labeler.yml">https://github.com/upptime/uptime-monitor/blob/master/.github/labeler.yml</a></label><pre class="src src-yaml">config:
  - ./*
tooling:
  - tooling/**/*.*
assets:
  - static/**/*.*
tests:
  - any: ["src/**/*.spec.js", "cypress/**/*"]
package:
  - any: ["package.json", "package-lock.json"]
source:
  - src/**/*
</pre>
</div>
</div>
</div>
<div id="outline-container-org23b439c" class="outline-3">
<h3 id="org23b439c"><a href="#org23b439c">GitHub Actionsのトリガー</a></h3>
<div class="outline-text-3" id="text-org23b439c">
<p>
pathsで特定ファイルが変更されたときのみ実行するときの注意点。
pushは使わずに、pull_requestトリガーを使うべき。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 6: </span>良い。Dockerfileが含まれるPRではすべて実行される</label><pre class="src src-yaml">on:
  pull_request:
    paths:
      - 'Dockerfile'
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 7: </span>悪い。Dockerfileが含まれないコミットでは実行されない。漏れやすい</label><pre class="src src-yaml">on:
  push:
    paths:
      - 'Dockerfile'
</pre>
</div>

<p>
pushではpull_request全体の変更を追うことができないので、コミットが分かれているとジョブが走らず、あたかもパスしているように見えて危険。
</p>
</div>
</div>
</div>
<div id="outline-container-org4419fe0" class="outline-2">
<h2 id="org4419fe0"><a href="#org4419fe0">Tasks</a></h2>
<div class="outline-text-2" id="text-org4419fe0">
</div>
<div id="outline-container-org7ad72f1" class="outline-3">
<h3 id="org7ad72f1"><a href="#org7ad72f1">実行時間の統計を取りたい</a></h3>
<div class="outline-text-3" id="text-org7ad72f1">
<p>
何で遅くなった、早くなったか把握したい。
</p>
</div>
</div>
<div id="outline-container-org84bbb2c" class="outline-3">
<h3 id="org84bbb2c"><a href="#org84bbb2c"><span class="done DONE">DONE</span> <a href="https://note.com/tably/n/n46041458d6b3">GitHub Actions向け自作アクションの作り方｜Tably｜note</a></a></h3>
<div class="outline-text-3" id="text-org84bbb2c">
<p>
作り方。
</p>
</div>
</div>
</div>
<div id="outline-container-org10e4816" class="outline-2">
<h2 id="org10e4816"><a href="#org10e4816">Reference</a></h2>
<div class="outline-text-2" id="text-org10e4816">
</div>
<div id="outline-container-orga9406ca" class="outline-3">
<h3 id="orga9406ca"><a href="#orga9406ca"><a href="https://github.com/release-drafter/release-drafter">release-drafter/release-drafter: Drafts your next release notes as pull requests are merged into master.</a></a></h3>
<div class="outline-text-3" id="text-orga9406ca">
<p>
タグを自動で打ち、リリースを作成する便利なアクション。
</p>
</div>
</div>
<div id="outline-container-org40bf869" class="outline-3">
<h3 id="org40bf869"><a href="#org40bf869"><a href="https://developer.mamezou-tech.com/blogs/2022/03/08/github-actions-reuse-workflows/">GitHub Actions - 再利用可能ワークフローを使う | 豆蔵デベロッパーサイト</a></a></h3>
<div class="outline-text-3" id="text-org40bf869">
<p>
reuseable workflowの説明。
</p>
</div>
</div>
<div id="outline-container-orgd232186" class="outline-3">
<h3 id="orgd232186"><a href="#orgd232186"><a href="https://stackoverflow.com/questions/69521380/secret-interpolation-is-giving-syntax-error-in-caller-workflow-when-calling-a-re">continuous integration - Secret interpolation is giving syntax error in caller workflow when calling a resusable workflow in GitHub Action - Stack Overflow</a></a></h3>
<div class="outline-text-3" id="text-orgd232186">
<p>
reuseable workflowでは secrets専用で渡す。
</p>
</div>
</div>
<div id="outline-container-org9109796" class="outline-3">
<h3 id="org9109796"><a href="#org9109796"><a href="https://zenn.dev/hsaki/articles/github-actions-component">GitHub ActionsにおけるStep/Job/Workflow設計論</a></a></h3>
</div>
<div id="outline-container-org439b3ae" class="outline-3">
<h3 id="org439b3ae"><a href="#org439b3ae"><a href="https://zenn.dev/snowcait/articles/787e83640746e1">Composite Action Template を作りました GitHub Actions</a></a></h3>
<div class="outline-text-3" id="text-org439b3ae">
<p>
自作アクションの作り方。ミニマルでわかりやすい。
<a href="https://github.com/snow-actions/git-config-user">snow-actions/git-config-user: Set git user name and email address</a>
</p>
</div>
</div>
</div>
<div id="outline-container-orga5617fb" class="outline-2">
<h2 id="orga5617fb"><a href="#orga5617fb">Archives</a></h2>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
